# IFC_CopyIFCData

## Description
Copies IFC data from one object to another

```pascal
FUNCTION IFC_CopyIFCData(
				hSource      : HANDLE;
				hDestination : HANDLE;
				inMode       : INTEGER) : BOOLEAN;
```

```python

def vs.IFC_CopyIFCData(hSource, hDestination, inMode):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hSource|HANDLE||
|hDestination|HANDLE||
|inMode|INTEGER||

## Version
Availability: from Vectorworks 2014
## Category
* IFC